[
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_1",
    "updateDate": "2018-12-05T08:00:00.0Z",
    "titleText": "Front End News",
    "mainText": "Microsoft is building a Chromium-powered web browser that will replace Edge on Windows 10. Built from the ground up with a new rendering engine known as EdgeHTML, Microsoft Edge was designed to be fast, lightweight, and secure, but it launched with a plethora of issues that resulted in users rejecting it early on. This is the first step towards revitalizing Windows 10's built-in web browser for users across PCs and phones.",
    "redirectionUrl": "https://blogs.windows.com/buildingapps/2018/12/04/announcing-open-source-of-wpf-windows-forms-and-winui-at-microsoft-connect-2018/"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_2",
    "updateDate": "2018-12-05T08:05:00.0Z",
    "titleText": "Front End News",
    "mainText": "Microsoft has announced they will open source WPF, Windows Forms, and WinUI. This announcement made at Microsoft Connect 2018, was done on top of announcing .NET Core 3.0 which adds support for building Windows desktop apps using WPF and Windows Forms.",
    "redirectionUrl": "http://materialtheme.arcsine.org/"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_3",
    "updateDate": "2018-12-05T08:07:00.0Z",
    "titleText": "Front End News",
    "mainText": "Google’s cross-platform Flutter UI toolkit hits version 1.0. Flutter, Google’s UI toolkit for building mobile Android and iOS applications, hit its version 1.0 release today. In addition, Google  also today announced a set of new third-party integrations with the likes of Square and others, as well as a couple of new features that make it easier to integrate Flutter with existing applications.",
    "redirectionUrl": "https://techcrunch.com/2018/12/04/googles-cross-platform-flutter-ui-toolkit-hits-version-1-0/"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_4",
    "updateDate": "2018-12-05T08:08:00.0Z",
    "titleText": "Front End News",
    "mainText": "Announcing Dark Reader extensions for Chrome, FireFox and Safari. This extension allows you have dark reading mode in your favourite browser. On top of that it's open source so you can add other browsers if you feel like a challenge. Visit darkreader.org for more information.",
    "redirectionUrl": "https://darkreader.org"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_4",
    "updateDate": "2018-12-05T08:09:00.0Z",
    "titleText": "Front End News",
    "mainText": "TypeScript 3.2 is now available. It introduces stricter checking on the apply, bind, and call methods and latest JavaScript features from the ECMAScript standard on older browsers and runtimes by compiling those features into a form that they understand. The most interesting feature is configuration inheritance vis node_modules packages. For more information see their release notes.",
    "redirectionUrl": "https://blogs.msdn.microsoft.com/typescript/2018/11/29/announcing-typescript-3-2/"
  }
]
