[
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_1",
    "updateDate": "2018-12-02T08:00:00.0Z",
    "titleText": "Front End News",
    "mainText": "React Fire is well underway. This week brings the new build infrastructure to host it. A work-in-progress implementation can be followed in a work in progress branch on React repository. React Fire is an effort to modernize React DOM. The goal is to make React better aligned with how the DOM works, revisit some controversial past decisions that led to problems, and make React smaller and faster. ",
    "redirectionUrl": "https://github.com/trueadm/react/tree/react-dom-fire"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_2",
    "updateDate": "2018-12-02T08:05:00.0Z",
    "titleText": "Front End News",
    "mainText": "Angular Material has been one of the products that has been the point of focus for Angular team for a while. While this framework allows you to have material design styles in your site, there hasn't been an easy way to customise the theme and use it. Here is how Material Theme Generator will help you. This generator let's you fully customise Angular Material themes and use it. To try it out head to materialtheme.arcsine.org/",
    "redirectionUrl": "http://materialtheme.arcsine.org/"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_3",
    "updateDate": "2018-12-02T08:07:00.0Z",
    "titleText": "Front End News",
    "mainText": "Introducing Beacon API, a way to send small amounts of data to a server without waiting for a response. Beacons are specifically for sending data and then forgetting about it. You don’t expect a response and don’t get a one either. This API brings a lot of possibilities, such as an efficient way to log information from a web page back to a server.",
    "redirectionUrl": "https://developer.mozilla.org/en-US/docs/Web/API/Beacon_API"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_4",
    "updateDate": "2018-12-02T08:08:00.0Z",
    "titleText": "Front End News",
    "mainText": "Angular v7 was recently released but the party is now officially over, now that Angular v7.1.0 is almost upon us – the release candidate phase has begun. This release brings some bug fixes and even more features like ability to mark an InvokeFunctionExpr as pure function, add updateOn option to FormBuilder, allow guards to return UrlTree as well as boolean, and some improvements on the service worker. For more info head to bit.ly/2DRpPOb",
    "redirectionUrl": "http://bit.ly/2DRpPOb"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_4",
    "updateDate": "2018-12-02T08:09:00.0Z",
    "titleText": "Front End News",
    "mainText": "Introducing Cloudflare Registrar: Domain Registration You Can Love. On its 8th birthday, Cloudflare introduced their registrar promising best possible security and best possible price. Adding two factor authentication, locking the registration by default and applying practices like DNSSEC are just a few of its benefits. For more info visit Cloudflare's website.",
    "redirectionUrl": "https://www.cloudflare.com/lp/cloudflare-registrar-intro/?utm_source=Registrar&utm_medium=Display&utm_campaign=Intro_LP"
  }
]
