[
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_1",
    "updateDate": "2018-12-10T08:00:00.0Z",
    "titleText": "Front End News",
    "mainText": "The npm blog announces some very interesting stats on this year in JavaScript and some predictions for 2019. This stats show that React's growth has slowed down, Angular's has remain flat and Vue's strong growth has continued. To find out more visit blog.npmjs.org",
    "redirectionUrl": "https://blog.npmjs.org/post/180868064080/this-year-in-javascript-2018-in-review-and-npms"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_2",
    "updateDate": "2018-12-10T08:05:00.0Z",
    "titleText": "Front End News",
    "mainText": "Until the introduction of CSS Shapes, it was nearly impossible to design a magazine-esque layout with free flowing text for the web. On the contrary, web design layouts have traditionally been shaped with grids, boxes, and straight lines. CSS Shapes allow us to define geometric shapes that text can flow around. These shapes can be circles, ellipses, simple or complex polygons, and even images and gradients. The browser support is good in Chrome and Firefox, but Edge still is behind (not for long though based on the recent news).",
    "redirectionUrl": "https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Shapes"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_3",
    "updateDate": "2018-12-10T08:07:00.0Z",
    "titleText": "Front End News",
    "mainText": "WordPress has a brand new content editor called “Gutenberg” that is going to shape WordPress for years to come. In this article, Andy Bell explains why it’s a movement and not just a new editor. So far, Gutenberg has had a very mixed reception from the WordPress community and that reception has become increasingly negative since a hard deadline was set for the 5.0 release, even though many considered it to be incomplete.",
    "redirectionUrl": "https://www.smashingmagazine.com/2018/12/gutenberg-accessibility-situation/"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_4",
    "updateDate": "2018-12-10T08:08:00.0Z",
    "titleText": "Front End News",
    "mainText": "Scott Helme (a security researcher in UK) shares information about a new security header that we can make use of: Clear Site Data allows site owners to clear data from cache, (local/session/permanent)storage, or cookies. This could be useful to delete sensitive or private data stored in localStorage or authentication cookies easily. During the use of a web app we can leave various pieces of data in the browser that we'd like to clear out if the user logs out or deletes their account. Clear Site Data gives us a reliable way to do that.",
    "redirectionUrl": "https://scotthelme.co.uk/a-new-security-header-clear-site-data/"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_4",
    "updateDate": "2018-12-10T08:09:00.0Z",
    "titleText": "Front End News",
    "mainText": "Flutter, Google’s UI toolkit for building mobile Android and iOS applications, hit its version 1.0 release last week. In addition, Google also today announced a set of new third-party integrations with the likes of Square and others, as well as a couple of new features that make it easier to integrate Flutter with existing applications.",
    "redirectionUrl": "https://techcrunch.com/2018/12/04/googles-cross-platform-flutter-ui-toolkit-hits-version-1-0/?utm_source=mobiledevweekly&utm_medium=email"
  }
]
