[
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_1",
    "updateDate": "2018-11-29T08:00:00.0Z",
    "titleText": "Front End News",
    "mainText": "The call for speakers is now open for NGVIKINGS 2019. This is a 100% community-driven event comprised of many Nordic Angular groups with more than 3500 active members in total, some of which are AngularJS Copenhagen, AngularJS Oslo, GDG Copenhagen and more. Visit ngvikings.org for more information.",
    "redirectionUrl": "https://ngvikings.org/"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_2",
    "updateDate": "2018-11-29T08:05:00.0Z",
    "titleText": "Front End News",
    "mainText": "React team have released the Roadmap for the first half of the 2019. They announced that the Suspense for code splitting is already shipped, React Hooks will be shipped Q1 2019, Concurrent Mode on Q2 2019, and Suspense for data fetching mid 2019. For more information visit their post on reactjs.org",
    "redirectionUrl": "https://reactjs.org/blog/2018/11/27/react-16-roadmap.html"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_3",
    "updateDate": "2018-11-29T08:07:00.0Z",
    "titleText": "Front End News",
    "mainText": "We all love free software, and open-source projects are the sweetest of all. The tech community has come to rely on them. That's why React Amsterdam has created a fun way of promoting open source projects, which is called open source awards. In 2019 they will repeat this and you can nominate your open source project of choice, the requirements are simple, the project should be open sourced and related to React ecosystem. Just head to osawards.com/react/ and submit your nomination.",
    "redirectionUrl": "https://osawards.com/react/"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_4",
    "updateDate": "2018-11-29T08:08:00.0Z",
    "titleText": "Front End News",
    "mainText": "Angular v7 was recently released but the party is now officially over, now that Angular v7.1.0 is almost upon us – the release candidate phase has begun. This release brings some bug fixes and even more features like ability to mark an InvokeFunctionExpr as pure function, add updateOn option to FormBuilder, allow guards to return UrlTree as well as boolean, and some improvements on the service worker. For more info head to bit.ly/2DRpPOb",
    "redirectionUrl": "http://bit.ly/2DRpPOb"
  },
  {
    "uid": "FRON_END_NEWS_ALEXA_FEED_4",
    "updateDate": "2018-11-29T08:09:00.0Z",
    "titleText": "Front End News",
    "mainText": "Introducing Cloudflare Registrar: Domain Registration You Can Love. On its 8th birthday, Cloudflare introduced their registrar promising best possible security and best possible price. Adding two factor authentication, locking the registration by default and applying practices like DNSSEC are just a few of its benefits. For more info visit Cloudflare's website.",
    "redirectionUrl": "https://www.cloudflare.com/lp/cloudflare-registrar-intro/?utm_source=Registrar&utm_medium=Display&utm_campaign=Intro_LP"
  }
]
